Revit 2026 API
DirectShape.AppendShape Method
Overload List
Name | Description
AppendShape(IList<GeometryObject>)
AppendShape(ShapeBuilder) |  Appends shape built by the supplied ShapeBuilderObject to shape representation stored in this DirectShape. The data stored in the supplied ShapeBuilder object will be cleared.
AppendShape(IList<GeometryObject>, DirectShapeTargetViewType)
Top
See Also
Reference
DirectShape Class
Autodesk.Revit.DB Namespace